{"format": "layers-model", "generatedBy": "keras v2.14.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "modelTopology": {"keras_version": "2.14.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_78", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_79"}, "name": "input_79", "inbound_nodes": []}, {"class_name": "Attention>Embedding", "config": {"conv": {"class_name": "Attention>Conv", "config": {"inner_dim": 96, "width": 100}, "__passive_serialization__": true}, "transformer": {"class_name": "Functional", "config": {"name": "model_62", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 96], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_63"}, "registered_name": null, "name": "input_63", "inbound_nodes": []}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.cast_2", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "cast"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.cast_2", "inbound_nodes": [["input_63", 0, 0, {"dtype": "bfloat16"}]]}, {"module": "smfret.tf_layers", "class_name": "PositionEmbedding", "config": {"max_length": 400, "initializer": "glorot_uniform", "seq_axis": 1}, "registered_name": "Attention>PositionEmbedding", "build_config": {"input_shape": [null, null, 96]}, "name": "position_embedding_2", "inbound_nodes": [[["input_63", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_18", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_18", "inbound_nodes": [["tf.cast_2", 0, 0, {"y": ["position_embedding_2", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_16", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_16", "inbound_nodes": [[["tf.__operators__.add_18", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_8", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "num_heads": 4, "key_dim": 96, "value_dim": 96, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, null, 96], "key_shape": [null, null, 96], "value_shape": [null, null, 96]}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "multi_head_attention_8", "inbound_nodes": [[["layer_normalization_16", 0, 0, {"value": ["layer_normalization_16", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_32", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_32", "inbound_nodes": [[["multi_head_attention_8", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_19", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_19", "inbound_nodes": [["dropout_32", 0, 0, {"y": ["tf.__operators__.add_18", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_17", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_17", "inbound_nodes": [[["tf.__operators__.add_19", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_84", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dense_84", "inbound_nodes": [[["layer_normalization_17", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_33", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_33", "inbound_nodes": [[["dense_84", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_85", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_85", "inbound_nodes": [[["dropout_33", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_34", "inbound_nodes": [[["dense_85", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_86", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 96, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_86", "inbound_nodes": [[["dropout_34", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_35", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_35", "inbound_nodes": [[["dense_86", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_20", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_20", "inbound_nodes": [["dropout_35", 0, 0, {"y": ["tf.__operators__.add_19", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_18", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_18", "inbound_nodes": [[["tf.__operators__.add_20", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_9", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "num_heads": 4, "key_dim": 96, "value_dim": 96, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, null, 96], "key_shape": [null, null, 96], "value_shape": [null, null, 96]}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "multi_head_attention_9", "inbound_nodes": [[["layer_normalization_18", 0, 0, {"value": ["layer_normalization_18", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_36", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_36", "inbound_nodes": [[["multi_head_attention_9", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_21", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_21", "inbound_nodes": [["dropout_36", 0, 0, {"y": ["tf.__operators__.add_20", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_19", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_19", "inbound_nodes": [[["tf.__operators__.add_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_87", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dense_87", "inbound_nodes": [[["layer_normalization_19", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_37", "inbound_nodes": [[["dense_87", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_88", "inbound_nodes": [[["dropout_37", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_38", "inbound_nodes": [[["dense_88", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 96, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_89", "inbound_nodes": [[["dropout_38", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_39", "inbound_nodes": [[["dense_89", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_22", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_22", "inbound_nodes": [["dropout_39", 0, 0, {"y": ["tf.__operators__.add_21", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_20", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_20", "inbound_nodes": [[["tf.__operators__.add_22", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_10", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "num_heads": 4, "key_dim": 96, "value_dim": 96, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, null, 96], "key_shape": [null, null, 96], "value_shape": [null, null, 96]}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "multi_head_attention_10", "inbound_nodes": [[["layer_normalization_20", 0, 0, {"value": ["layer_normalization_20", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_40", "inbound_nodes": [[["multi_head_attention_10", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_23", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_23", "inbound_nodes": [["dropout_40", 0, 0, {"y": ["tf.__operators__.add_22", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_21", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_21", "inbound_nodes": [[["tf.__operators__.add_23", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dense_90", "inbound_nodes": [[["layer_normalization_21", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_41", "inbound_nodes": [[["dense_90", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_91", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_91", "inbound_nodes": [[["dropout_41", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_42", "inbound_nodes": [[["dense_91", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 96, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_92", "inbound_nodes": [[["dropout_42", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_43", "inbound_nodes": [[["dense_92", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_24", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_24", "inbound_nodes": [["dropout_43", 0, 0, {"y": ["tf.__operators__.add_23", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_22", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_22", "inbound_nodes": [[["tf.__operators__.add_24", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_11", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "num_heads": 4, "key_dim": 96, "value_dim": 96, "dropout": 0.0, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, null, 96], "key_shape": [null, null, 96], "value_shape": [null, null, 96]}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "multi_head_attention_11", "inbound_nodes": [[["layer_normalization_22", 0, 0, {"value": ["layer_normalization_22", 0, 0]}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_44", "inbound_nodes": [[["multi_head_attention_11", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_25", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_25", "inbound_nodes": [["dropout_44", 0, 0, {"y": ["tf.__operators__.add_24", 0, 0], "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_23", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "layer_normalization_23", "inbound_nodes": [[["tf.__operators__.add_25", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dense_93", "inbound_nodes": [[["layer_normalization_23", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_45", "inbound_nodes": [[["dense_93", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 384, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_94", "inbound_nodes": [[["dropout_45", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_46", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dropout_46", "inbound_nodes": [[["dense_94", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 96, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 384]}, "name": "dense_95", "inbound_nodes": [[["dropout_46", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "rate": 0.2, "noise_shape": null, "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, null, 96]}, "name": "dropout_47", "inbound_nodes": [[["dense_95", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_26", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "function": "__operators__.add"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, null, 96]}, "name": "tf.__operators__.add_26", "inbound_nodes": [["dropout_47", 0, 0, {"y": ["tf.__operators__.add_25", 0, 0], "name": null}]]}], "input_layers": [["input_63", 0, 0]], "output_layers": [["tf.__operators__.add_26", 0, 0]]}, "__passive_serialization__": true}, "prepend_task_token": {"class_name": "Attention>PrependTaskToken", "config": {"token_dim": 96}, "__passive_serialization__": true}, "reconstructor": {"class_name": "Attention>Reconstructor", "config": {"width": 100}, "__passive_serialization__": true}, "framewise": true}, "name": "embedding_75", "inbound_nodes": [[["input_79", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_111", "trainable": true, "dtype": {"module": "keras.mixed_precision", "class_name": "Policy", "config": {"name": "mixed_bfloat16"}, "registered_name": null}, "units": 12, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_111", "inbound_nodes": [[["embedding_75", 0, 0, {}]]]}], "input_layers": [["input_79", 0, 0]], "output_layers": [["dense_111", 0, 0]]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": true, "ignore_class": null, "fn": "sparse_categorical_crossentropy"}}, "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>RMSprop", "config": {"name": "RMSprop", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": 100, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dense_111/kernel", "shape": [96, 12], "dtype": "float32"}, {"name": "dense_111/bias", "shape": [12], "dtype": "float32"}, {"name": "embedding_60/conv_2/weight", "shape": [100, 4, 96], "dtype": "float32"}, {"name": "embedding_60/conv_2/bias", "shape": [1, 1, 96], "dtype": "float32"}, {"name": "position_embedding_2/embeddings", "shape": [400, 96], "dtype": "float32"}, {"name": "layer_normalization_16/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_16/beta", "shape": [96], "dtype": "float32"}, {"name": "multi_head_attention_8/query/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/query/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/key/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/key/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/value/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/value/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/attention_output/kernel", "shape": [4, 96, 96], "dtype": "float32"}, {"name": "multi_head_attention_8/attention_output/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_17/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_17/beta", "shape": [96], "dtype": "float32"}, {"name": "dense_84/kernel", "shape": [96, 384], "dtype": "float32"}, {"name": "dense_84/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_85/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "dense_85/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_86/kernel", "shape": [384, 96], "dtype": "float32"}, {"name": "dense_86/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_18/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_18/beta", "shape": [96], "dtype": "float32"}, {"name": "multi_head_attention_9/query/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/query/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/key/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/key/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/value/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/value/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/attention_output/kernel", "shape": [4, 96, 96], "dtype": "float32"}, {"name": "multi_head_attention_9/attention_output/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_19/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_19/beta", "shape": [96], "dtype": "float32"}, {"name": "dense_87/kernel", "shape": [96, 384], "dtype": "float32"}, {"name": "dense_87/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_88/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "dense_88/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_89/kernel", "shape": [384, 96], "dtype": "float32"}, {"name": "dense_89/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_20/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_20/beta", "shape": [96], "dtype": "float32"}, {"name": "multi_head_attention_10/query/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/query/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/key/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/key/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/value/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/value/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/attention_output/kernel", "shape": [4, 96, 96], "dtype": "float32"}, {"name": "multi_head_attention_10/attention_output/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_21/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_21/beta", "shape": [96], "dtype": "float32"}, {"name": "dense_90/kernel", "shape": [96, 384], "dtype": "float32"}, {"name": "dense_90/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_91/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "dense_91/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_92/kernel", "shape": [384, 96], "dtype": "float32"}, {"name": "dense_92/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_22/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_22/beta", "shape": [96], "dtype": "float32"}, {"name": "multi_head_attention_11/query/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/query/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/key/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/key/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/value/kernel", "shape": [96, 4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/value/bias", "shape": [4, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/attention_output/kernel", "shape": [4, 96, 96], "dtype": "float32"}, {"name": "multi_head_attention_11/attention_output/bias", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_23/gamma", "shape": [96], "dtype": "float32"}, {"name": "layer_normalization_23/beta", "shape": [96], "dtype": "float32"}, {"name": "dense_93/kernel", "shape": [96, 384], "dtype": "float32"}, {"name": "dense_93/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_94/kernel", "shape": [384, 384], "dtype": "float32"}, {"name": "dense_94/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_95/kernel", "shape": [384, 96], "dtype": "float32"}, {"name": "dense_95/bias", "shape": [96], "dtype": "float32"}, {"name": "embedding_60/prepend_task_token_2/token", "shape": [1, 1, 96], "dtype": "float32"}, {"name": "embedding_60/reconstructor_2/remap", "shape": [96, 50, 96], "dtype": "float32"}]}]}